import Mathlib.Data.Nat.Prime.Defs\nimport Mathlib.Data.Nat.ModEq\nimport Mathlib.Data.Nat.Totient

set_option exponentiation.threshold 2000
set_option maxRecDepth 200000

open Nat Finset

/--
A234360: $a(n) = \left|\left\{0 < k < n: (k+1)^{\phi(n-k)} + k \text{ is prime}\right\}\right|$, where $\phi(\cdot)$ is Euler's totient function.
-/
def a (n : ℕ) : ℕ :=
  (filter (fun k => Nat.Prime ((k + 1) ^ (Nat.totient (n - k)) + k)) (Ico 1 n)).card

def divisors_list : List ℕ := [3, 31, 13, 3, 8819, 43, 3, 7, 5867, 3, 529181351, 47, 3, 47, 7, 3, 171593370671, 191, 3, 13679, 5, 3, 29, 601, 3, 23, 347, 3, 7, 403498239348707, 3, 881, 97, 3, 13, 7, 3, 1483, 19, 3, 794311889339, 17, 3, 269, 19, 3, 37, 107, 3, 7, 7, 3, 13, 2971, 3, 5, 7, 3, 67, 11, 3, 199, 37, 3, 164357, 5, 3, 67, 743, 3, 7, 7, 3, 7, 660719, 3, 61357, 7, 3, 101, 11, 3, 41, 1, 3, 8719, 101, 3, 19, 313, 3, 7, 7, 3, 87520021, 5, 3, 17, 7, 3, 1129, 7, 3, 9161, 3307, 3, 7, 23, 3, 487, 5, 3, 7, 11, 3, 5, 23, 3, 19, 7, 3, 13, 7, 3, 1, 5, 3, 89, 41, 3, 17293, 4987, 3, 7, 11, 3, 17, 1637499265217, 3, 17, 5, 3, 547, 13, 3, 249971305257836411, 73, 3, 83, 43, 3, 29, 23563, 3, 7, 5, 3, 67, 79, 3, 5, 7, 3, 546546697, 7, 3, 397, 782711, 3, 20803827362834972369, 31, 3, 23, 31, 3, 5, 5, 3, 7, 2381, 3, 101, 7, 3, 19, 5, 3, 11, 41, 3, 5, 1470913, 3, 4363, 587, 3, 7, 449, 3, 242021371665673, 5, 3, 99689, 7, 3, 5, 1063, 3, 13, 145687, 3, 11, 19, 3, 1531, 5, 3, 7, 7, 3, 1, 17, 3, 11, 7, 3, 73, 67057, 3, 27011, 73, 3, 6734346677, 1361682414135461797, 3, 5, 41, 3, 7, 103, 3, 7, 13, 3, 47, 7, 3, 37, 31, 3, 5, 103, 3, 47678065957, 5568615539, 3, 5, 4339, 3, 7, 5, 3, 167, 846647, 3, 249947, 7, 3, 67, 7, 3, 2423, 19, 3, 5087861, 137, 3, 11, 5839, 3, 7, 188212071547, 3, 23, 149, 3, 363057971523869, 7, 3, 67, 17, 3, 17, 23, 3, 5, 67, 3, 271, 13, 3, 7, 2753, 3, 21419, 5, 3, 13, 7, 3, 5, 7, 3, 59, 59, 3, 116243, 31, 3, 19, 14281, 3, 7, 19, 3, 4027, 283, 3, 144335748923, 7, 3, 283, 229, 3, 240763273, 5, 3, 7, 251, 3, 5, 11, 3, 7, 1, 3, 7, 83, 3, 31, 7, 3, 11, 1, 3, 47, 593149631, 3, 7, 13, 3, 1613, 181, 3, 7, 5, 3, 79, 402923, 3, 5, 7, 3, 139, 293, 3, 5, 13, 3, 23, 5, 3, 1769500854815943251, 29, 3, 5, 53, 3, 809, 31, 3, 41, 7, 3, 331, 5, 3, 158803, 11, 3, 5, 5, 3, 23, 1949, 3, 7, 7, 3, 11, 11, 3, 29, 7, 3, 5, 5, 3, 223, 41, 3, 7, 19, 3, 137, 23, 3, 7, 7, 3, 5, 109, 3, 431, 7, 3, 4363, 1, 3, 157, 269, 3, 11, 3231236428727, 3, 5, 13, 3, 7, 47, 3, 13, 149, 3, 23, 5, 3, 20071, 1, 3, 19, 289309, 3, 21894536939136486169, 337, 3, 19, 1901, 3, 7, 5, 3, 7, 102161, 3, 5, 7, 3, 43, 7, 3, 5, 241, 3, 11, 19, 3, 127, 647, 3, 7, 7307, 3, 26417, 23, 3, 5, 7, 3, 11, 17, 3, 2083, 199, 3, 5, 37, 3, 67, 13, 3, 7, 7, 3, 23, 5507, 3, 19, 7, 3, 11, 197, 3, 9991387131487, 13, 3, 7, 17, 3, 29761, 577, 3, 7, 1110999863452579, 3, 5, 67, 3, 313333, 7, 3, 149, 7, 3, 107, 19, 3, 25839721, 503, 3, 5, 31, 3, 7, 11, 3, 881, 113, 3, 19, 7, 3, 359, 4231, 3, 55487, 164778053689, 3, 117133, 31, 3, 2473, 67, 3, 7, 5, 3, 7, 157, 3, 983, 7, 3, 220174029260221, 23, 3, 23, 37, 3, 2431329877, 509, 3, 37, 233, 3, 5, 11731, 3, 7, 19, 3, 23, 7, 3, 151, 5, 3, 37, 11, 3, 7, 5527, 3, 875136707533303, 197, 3, 7, 269, 3, 139, 1, 3, 1, 7, 3, 5, 7, 3, 1213, 11, 3, 53824369, 17, 3, 103, 5, 3, 7, 127, 3, 5, 5, 3, 1027547, 7, 3, 211, 1249, 3, 20231, 173, 3, 59, 641, 3, 5, 5, 3, 7, 967, 3, 29, 37, 3, 1, 5, 3, 65003, 2633, 3, 67, 13, 3, 61, 83, 3, 13, 49633, 3739, 7, 1657, 3, 11, 353, 3, 15531055433022842327, 7, 3, 11, 127, 3, 31, 17675830619209207, 3, 2285367971, 5, 3, 13, 71, 3, 5, 7, 3, 8988444559, 1699, 3, 19, 7, 3, 521, 5, 3, 367, 83073589, 3, 5, 125749039001743, 3, 252319, 109, 3, 5, 7, 3, 1321, 97, 3, 89, 7, 3, 13, 67, 3, 807015961, 455513, 3, 79138649, 67, 3, 17, 5, 3, 7, 7, 3, 13, 43, 3, 41, 7, 3, 1083007, 7, 3, 379, 16176003749630197651046483, 3, 53, 53, 3, 1187, 11, 3, 7, 56009, 3, 7, 23, 3, 13, 5, 3, 3928667, 7, 3, 5, 5, 3, 23433201349, 70373, 3, 48242807, 3089, 3, 7, 190445303334791, 3, 31377349, 21599, 3, 5, 7, 3, 173, 401, 3, 11, 97, 3, 17, 29, 3, 17, 11, 3, 7, 13, 3, 2759059, 14815891427, 3, 17, 7, 3, 13, 5, 3, 18869, 577349, 3, 59, 13, 3, 14831, 681451, 3, 7, 317, 3, 11, 5, 3, 19, 7, 3, 5, 13, 3, 11, 37, 3, 23, 19, 3, 769, 5, 3, 7, 239543, 3, 7, 1, 3, 461239, 7, 3, 199, 283, 3, 47, 389, 3, 11, 3767, 3, 7853672213, 6983214534878053061543, 3, 7, 7, 3, 13, 31, 3, 313, 5, 3, 7933, 10711, 3, 5, 5, 3, 35027, 5789657, 3, 13, 42351745914307, 3, 7, 7, 3, 15325151, 800131, 3, 5, 7, 3, 67943, 1163, 3, 199, 11, 3, 3793, 355171, 3, 5477, 11, 3, 7, 3092435830090367, 3, 1, 838141, 3, 1667, 7, 3, 107, 6047, 10039, 569, 31, 3, 5, 3413, 3, 887, 59, 3, 7, 1579, 3, 293, 5, 3, 19, 7, 3, 271, 7, 3, 47917, 29, 3, 7, 2437, 3, 1753, 5, 3, 7, 10847, 3, 5, 19, 3, 37, 7, 3, 5, 7, 3, 16132147816867800931, 5, 3, 7, 89, 3, 52769837016241073, 11, 3, 7, 23, 3, 5, 27434893, 3, 45181, 5, 3, 179, 7, 3, 1, 191, 3, 271, 47, 3, 2917, 11, 3, 7, 107, 3, 7, 1801, 3, 5, 7, 3, 3359, 10501, 3, 1015057, 727, 3, 349, 47, 3, 3539659199765102262185738435189, 19, 3, 5, 7, 3, 7, 67, 3, 439, 7, 3, 6361, 1, 3, 13, 59, 3, 5, 571, 3, 67, 5059, 3, 7, 17, 3, 802811, 140244715038523, 3, 41, 7, 3, 11, 5, 3, 19, 163, 3, 37, 547, 3, 17, 5, 3, 7, 11, 3, 239, 13, 3, 101, 7, 3, 23, 157, 3, 31, 5, 3, 67, 19009, 3, 13, 11681, 3, 7, 7, 3, 101, 1, 3, 359, 7, 3, 67, 7, 3, 3559, 763105712885013172313, 3, 4127, 61, 3, 5, 1223, 3, 7, 61, 3, 3373, 53, 3, 71, 7, 3, 98638571312861, 7, 3, 107, 19, 3, 7, 5, 3, 1251043, 6131, 3, 5, 223, 3, 631, 672135701533321, 3, 13, 7, 3, 17, 2693, 3, 1, 13, 3, 5, 5, 3, 43, 67, 3, 7, 7, 3, 19, 61, 3, 11, 7, 3, 5, 1487593, 3, 67, 1069, 3, 284580317591, 733, 3, 17, 5, 3, 7, 937, 210284093, 941, 11, 3, 11, 7, 3, 257, 7, 3, 151, 5, 3, 7, 34589, 3, 11, 11, 3, 7, 2873228025861587828906861, 3, 281, 149, 3, 12641, 7, 3, 79, 21841, 3, 5, 110933, 3, 14771, 23, 3, 5, 31, 3, 7, 7, 3, 17, 97, 3, 541, 7, 3, 11, 11, 3, 5, 1294987, 3, 2711, 5, 3, 13, 11, 3, 5, 21017, 3, 1097, 953, 3, 19, 7, 3, 23, 1229, 3, 13, 47, 3, 29, 197, 3, 11, 23, 17, 7, 7, 3, 11, 1691710977527, 3, 3932543, 7, 3, 5, 5, 3, 937, 23, 3, 13, 389, 3, 53, 43499, 3, 7, 53, 3, 5, 569, 3, 451186444545373833293, 7, 3, 80761, 74515751, 3, 19, 863, 3, 7, 22590821857, 3, 1466243, 5, 3, 7, 11, 3, 101, 139, 3, 4085316950249, 5, 3, 73, 244654149815032239159603569, 3, 241, 67, 3, 31, 107, 3, 31, 877, 3, 7, 5, 3, 131, 37, 3, 364943, 7, 3, 47, 7, 3, 11714264907223, 61, 3, 557, 5, 5, 37, 29, 3, 7, 1033, 3, 103668911, 10650259, 3, 5, 7, 3, 23, 7893378125707, 3, 89, 17, 3, 97, 23, 3, 11, 313, 3, 7, 7, 67, 7, 5, 3, 19, 7, 3, 8243, 5, 3, 9364666105667, 89223718921086011, 3, 7, 11, 3, 13, 596845725974037610079, 3, 7, 7, 3, 5, 5, 3, 17, 7, 127, 2351, 3413, 3, 1597, 609743, 3, 223, 11, 11, 5, 83, 3, 7, 2417, 3, 53, 19, 19, 13, 7, 0, 373, 0, 0, 0, 0]

def exponents_list : List ℕ := [396, 324, 560, 216, 660, 350, 466, 240, 699, 232, 630, 348, 360, 320, 594, 224, 636, 276, 462, 346, 648, 180, 552, 344, 460, 345, 690, 176, 588, 312, 432, 336, 500, 228, 686, 294, 456, 272, 666, 216, 683, 341, 288, 300, 644, 226, 680, 256, 450, 288, 638, 224, 540, 338, 400, 312, 576, 180, 630, 336, 448, 336, 536, 192, 624, 300, 444, 264, 612, 222, 570, 332, 352, 308, 630, 216, 605, 216, 442, 328, 663, 192, 520, 330, 378, 330, 660, 160, 659, 329, 438, 276, 524, 216, 600, 320, 396, 260, 480, 216, 653, 326, 336, 324, 651, 180, 650, 240, 432, 290, 648, 216, 432, 323, 430, 288, 645, 168, 644, 264, 360, 321, 512, 212, 641, 320, 360, 256, 639, 210, 638, 280, 320, 252, 594, 208, 600, 252, 414, 316, 540, 210, 440, 312, 420, 315, 576, 144, 629, 288, 418, 312, 500, 180, 534, 312, 414, 250, 624, 192, 588, 264, 328, 310, 560, 198, 576, 240, 348, 309, 618, 204, 432, 308, 408, 240, 615, 160, 614, 306, 408, 306, 420, 192, 611, 276, 360, 240, 572, 168, 608, 288, 324, 303, 606, 200, 516, 220, 360, 300, 560, 198, 480, 252, 400, 300, 600, 160, 540, 299, 324, 264, 476, 198, 596, 296, 396, 192, 560, 180, 593, 296, 312, 288, 468, 196, 590, 232, 390, 270, 530, 168, 460, 293, 352, 292, 585, 144, 498, 288, 388, 260, 464, 192, 581, 246, 378, 224, 540, 192, 528, 272, 240, 288, 576, 192, 575, 220, 382, 240, 540, 190, 456, 240, 378, 285, 486, 144, 528, 284, 378, 280, 452, 162, 510, 282, 336, 224, 564, 184, 462, 281, 300, 280, 561, 160, 522, 192, 372, 252, 558, 180, 444, 278, 312, 276, 500, 144, 554, 276, 360, 234, 384, 176, 551, 252, 366, 200, 468, 180, 548, 272, 288, 273, 546, 144, 545, 216, 330, 256, 543, 180, 360, 270, 342, 270, 506, 144, 492, 210, 358, 268, 420, 178, 504, 264, 288, 212, 534, 176, 480, 240, 280, 216, 531, 174, 530, 208, 352, 253, 450, 160, 420, 240, 324, 262, 525, 120, 524, 260, 348, 261, 360, 168, 444, 260, 346, 192, 519, 172, 480, 216, 264, 230, 516, 168, 515, 204, 294, 256, 468, 162, 400, 256, 300, 216, 510, 128, 509, 254, 336, 252, 336, 156, 506, 220, 336, 200, 504, 144, 468, 251, 264, 250, 464, 166, 360, 200, 324, 249, 498, 164, 396, 210, 330, 240, 495, 120, 462, 216, 276, 224, 392, 160, 491, 245, 324, 168, 440, 162, 488, 240, 240, 243, 414, 162, 485, 192, 288, 220, 483, 132, 384, 240, 318, 216, 465, 128, 408, 239, 280, 238, 380, 156, 476, 192, 316, 180, 432, 156, 473, 210, 216, 232, 440, 156, 470, 184, 312, 198, 468, 144, 320, 233, 310, 232, 378, 120, 464, 224, 306, 231, 360, 120, 420, 230, 306, 176, 459, 144, 390, 228, 240, 228, 410, 144, 455, 144, 300, 226, 453, 150, 360, 224, 252, 200, 416, 120, 420, 224, 264, 192, 356, 148, 414, 222, 270, 176, 378, 144, 443, 221, 232, 192, 441, 126, 440, 160, 292, 219, 438, 144, 300, 198, 288, 216, 396, 112, 390, 180, 272, 216, 344, 144, 431, 215, 240, 168, 429, 120, 428, 212, 216, 180, 426, 140, 396, 160, 282, 208, 330, 138, 312, 210, 280, 210, 406, 96, 419, 209, 270, 180, 332, 138, 336, 192, 276, 164, 414, 132, 413, 174, 200, 204, 411, 136, 410, 160, 216, 204, 378, 128, 324, 180, 270, 168, 405, 108, 404, 200, 268, 180, 264, 132, 360, 200, 264, 160, 368, 108, 398, 198, 208, 198, 360, 120, 336, 156, 262, 196, 393, 130, 312, 168, 252, 176, 350, 96, 360, 194, 216, 192, 300, 126, 386, 192, 256, 120, 384, 128, 348, 191, 192, 190, 324, 126, 380, 144, 220, 189, 378, 108, 300, 168, 250, 184, 375, 100, 318, 160, 246, 186, 296, 120, 371, 156, 216, 144, 369, 120, 330, 176, 168, 183, 366, 120, 336, 144, 243, 144, 363, 110, 280, 180, 240, 171, 306, 96, 359, 179, 238, 178, 240, 96, 330, 176, 234, 140, 354, 116, 300, 176, 184, 160, 324, 108, 350, 120, 232, 174, 320, 112, 276, 173, 180, 172, 345, 88, 312, 168, 228, 147, 272, 108, 341, 150, 226, 128, 288, 112, 338, 156, 180, 168, 336, 96, 300, 132, 222, 166, 308, 108, 216, 164, 192, 165, 330, 80, 329, 138, 216, 160, 260, 108, 326, 162, 180, 120, 290, 108, 323, 144, 168, 132, 321, 106, 320, 128, 210, 140, 252, 104, 252, 158, 210, 156, 315, 72, 288, 156, 180, 156, 250, 96, 264, 155, 198, 120, 309, 102, 308, 120, 160, 153, 306, 96, 276, 120, 168, 144, 303, 100, 220, 150, 198, 126, 300, 80, 299, 132, 198, 148, 192, 90, 296, 144, 196, 116, 270, 84, 293, 146, 144, 144, 260, 96, 246, 112, 192, 136, 288, 96, 220, 120, 190, 120, 285, 72, 284, 140, 162, 141, 224, 92, 281, 140, 160, 96, 252, 90, 278, 138, 144, 138, 234, 88, 252, 100, 180, 136, 273, 72, 216, 128, 180, 135, 270, 72, 210, 134, 178, 132, 212, 88, 240, 108, 174, 104, 253, 80, 240, 131, 120, 130, 261, 84, 260, 96, 172, 108, 230, 84, 204, 128, 162, 128, 216, 64, 254, 126, 156, 110, 200, 72, 251, 125, 166, 100, 249, 82, 210, 120, 120, 108, 224, 80, 245, 84, 162, 120, 243, 81, 192, 110, 132, 120, 216, 64, 239, 119, 156, 96, 180, 78, 210, 116, 156, 92, 198, 72, 233, 116, 120, 112, 231, 60, 230, 88, 144, 114, 228, 72, 144, 113, 150, 112, 200, 60, 224, 96, 148, 111, 176, 72, 221, 96, 126, 80, 219, 72, 198, 108, 112, 90, 216, 72, 215, 84, 120, 106, 180, 70, 160, 104, 138, 105, 210, 48, 209, 90, 138, 96, 164, 66, 174, 102, 136, 80, 204, 64, 180, 84, 108, 100, 180, 66, 200, 80, 108, 99, 198, 60, 156, 98, 130, 84, 176, 48, 194, 96, 126, 96, 120, 64, 191, 95, 126, 72, 189, 54, 168, 92, 100, 80, 186, 60, 156, 72, 120, 88, 183, 60, 144, 72, 110, 90, 171, 48, 179, 89, 96, 88, 140, 58, 176, 80, 108, 60, 174, 56, 173, 86, 88, 84, 147, 54, 150, 64, 112, 78, 168, 48, 132, 83, 108, 82, 165, 40, 138, 80, 108, 81, 120, 54, 144, 66, 106, 64, 140, 52, 158, 78, 72, 78, 156, 48, 155, 60, 102, 60, 153, 48, 120, 72, 100, 75, 126, 40, 132, 74, 90, 72, 116, 42, 146, 72, 96, 56, 136, 48, 120, 60, 72, 70, 141, 46, 140, 48, 90, 69, 138, 44, 100, 68, 72, 64, 135, 36, 134, 66, 88, 54, 104, 40, 131, 65, 84, 48, 108, 42, 128, 64, 64, 63, 110, 36, 125, 50, 82, 60, 108, 40, 84, 60, 81, 55, 120, 32, 119, 48, 78, 58, 92, 36, 116, 56, 60, 44, 114, 36, 113, 56, 60, 48, 111, 36, 96, 40, 72, 54, 90, 36, 84, 53, 70, 52, 105, 24, 90, 48, 66, 51, 80, 32, 84, 50, 66, 40, 99, 30, 98, 42, 48, 48, 96, 32, 95, 36, 54, 46, 80, 30, 72, 44, 60, 36, 90, 24, 89, 44, 58, 40, 60, 28, 86, 42, 54, 32, 78, 24, 83, 41, 40, 40, 81, 27, 66, 32, 52, 39, 78, 24, 60, 30, 48, 36, 75, 20, 74, 36, 42, 36, 56, 24, 60, 35, 46, 24, 69, 22, 68, 32, 36, 33, 54, 20, 65, 24, 42, 32, 63, 18, 50, 30, 40, 30, 55, 16, 48, 29, 36, 28, 44, 18, 56, 24, 36, 20, 54, 18, 53, 26, 24, 24, 51, 16, 50, 20, 30, 21, 48, 16, 36, 23, 30, 22, 36, 12, 44, 20, 28, 21, 32, 12, 41, 20, 27, 16, 39, 12, 30, 18, 20, 18, 36, 12, 35, 12, 22, 16, 33, 10, 24, 16, 18, 15, 30, 8, 29, 14, 18, 12, 20, 9, 26, 12, 16, 10, 21, 8, 23, 11, 12, 10, 21, 6, 20, 8, 12, 9, 18, 6, 12, 8, 10, 8, 15, 4, 14, 6, 9, 6, 10, 4, 11, 5, 6, 4, 9, 3, 8, 4, 4, 3, 6, 2, 5, 2, 3, 2, 3, 1, 2, 1, 1, 0, 0]

inductive DivResult where
  | le_one : DivResult
  | divisor (d : ℕ) : DivResult
  | Fermat : DivResult

def get_divisor (k : ℕ) : DivResult :=
  match divisors_list[k - 1]? with
  | some 0 => .le_one
  | some 1 => .Fermat
  | some d => .divisor d
  | none => .le_one

def get_exponent (k : ℕ) : ℕ :=
  match exponents_list[k - 1]? with
  | some e => e
  | none => 0

def powMod (b e m : ℕ) : ℕ :=
  if h : e = 0 then 1
  else if e % 2 = 1 then
    have : e / 2 < e := Nat.div_lt_self (Nat.pos_of_ne_zero h) (by decide)
    (powMod b (e / 2) m) ^ 2 * b % m
  else
    have : e / 2 < e := Nat.div_lt_self (Nat.pos_of_ne_zero h) (by decide)
    (powMod b (e / 2) m) ^ 2 % m

theorem powMod_eq (b e m : ℕ) (hm : 1 < m) : powMod b e m = b ^ e % m := by
  induction e using powMod.induct with
  | case1 =>
    unfold powMod
    simp only [↓reduceDIte]
    rw [pow_zero, Nat.mod_eq_of_lt hm]
  | case2 x hx h_odd h_lt ih =>
    unfold powMod
    simp only [hx, h_odd, ↓reduceDIte]
    rw [if_pos True.intro]
    have h_arith : (x / 2) * 2 + 1 = x := by omega
    have h_pow : (b ^ (x / 2)) ^ 2 * b = b ^ x := by
      rw [show b ^ x = b ^ ((x / 2) * 2 + 1) by rw [h_arith]]
      rw [Nat.pow_add, Nat.pow_mul, Nat.pow_one]
    rw [ih, Nat.mul_mod, ← Nat.pow_mod, ← Nat.mul_mod, h_pow]
  | case3 x hx h_even h_lt ih =>
    unfold powMod
    simp only [hx, h_even, ↓reduceDIte]
    rw [if_neg not_false]
    have h_arith : (x / 2) * 2 = x := by omega
    have h_pow : (b ^ (x / 2)) ^ 2 = b ^ x := by
      rw [show b ^ x = b ^ ((x / 2) * 2) by rw [h_arith]]
      rw [Nat.pow_mul]
    rw [ih, ← Nat.pow_mod, h_pow]

lemma coprime_two_of_prime_ne_two {p : ℕ} (hp : p.Prime) (h2 : p ≠ 2) : Coprime 2 p := by
  have h_dvd : ¬ p ∣ 2 := by
    intro hd
    have : p ≤ 2 := Nat.le_of_dvd (by decide) hd
    have : 2 ≤ p := hp.two_le
    have : p = 2 := by omega
    exact h2 this
  have h_cop : Coprime p 2 := hp.coprime_iff_not_dvd.mpr h_dvd
  exact h_cop.symm

lemma not_prime_of_fermat_test_failed {p : ℕ} (hp2 : p ≠ 2) (h_pow : powMod 2 (p - 1) p % p ≠ 1) : ¬ p.Prime := by
  intro hp
  have hp1 : 1 < p := hp.one_lt
  have h_cop : Coprime 2 p := coprime_two_of_prime_ne_two hp hp2
  have h_fermat := Nat.ModEq.pow_card_sub_one_eq_one hp h_cop
  unfold Nat.ModEq at h_fermat
  rw [Nat.mod_eq_of_lt hp1] at h_fermat
  have h_powMod := powMod_eq 2 (p - 1) p hp1
  rw [h_fermat] at h_powMod
  have h_mod2 : powMod 2 (p - 1) p % p = 1 % p := by rw [h_powMod]
  rw [Nat.mod_eq_of_lt hp1] at h_mod2
  exact h_pow h_mod2

lemma not_prime_of_dvd {p m : ℕ} (hm : 2 ≤ m) (hmp : m < p) (hdvd : m ∣ p) : ¬ Nat.Prime p := by
  intro hp
  rw [prime_def_lt'] at hp
  exact hp.2 m hm hmp hdvd

def isComposite (n k : ℕ) : Bool :=
  let v := (k + 1) ^ (get_exponent k) - k
  match get_divisor k with
  | .le_one => decide (v <= 1)
  | .divisor d => decide (v % d == 0) && decide (1 < d) && decide (d < v)
  | .Fermat => decide (powMod 2 (v - 1) v % v != 1) && decide (v != 2)

theorem isComposite_correct (n k : ℕ) (h_comp : isComposite n k = true) : ¬ Nat.Prime ((k + 1) ^ (get_exponent k) - k) := by
  set v := (k + 1) ^ (get_exponent k) - k
  unfold isComposite at h_comp
  split at h_comp
  · -- le_one
    intro hp
    have hp1 : 1 < v := hp.one_lt
    have : v ≤ 1 := of_decide_eq_true h_comp
    omega
  · -- divisor
    intro hp
    rw [Bool.and_eq_true] at h_comp
    have h_and2 := h_comp.1
    rw [Bool.and_eq_true] at h_and2
    have hd_dvd : v % _ = 0 := of_decide_eq_true h_and2.1
    have hd_gt1 : 1 < _ := of_decide_eq_true h_and2.2
    have hd_ltv : _ < v := of_decide_eq_true h_comp.2
    have hd_dvd_v : _ ∣ v := Nat.dvd_of_mod_eq_zero hd_dvd
    have hd_ge2 : 2 ≤ _ := hd_gt1
    exact not_prime_of_dvd hd_ge2 hd_ltv hd_dvd_v hp
  · -- Fermat
    intro hp
    rw [Bool.and_eq_true] at h_comp
    have hp2 : v ≠ 2 := of_decide_eq_true h_comp.2
    have h_pow : powMod 2 (v - 1) v % v ≠ 1 := of_decide_eq_true h_comp.1
    exact not_prime_of_fermat_test_failed hp2 h_pow hp

def check_range (start len : ℕ) : Bool :=
  match len with
  | 0 => true
  | l' + 1 => isComposite 1408 (start + l') && check_range start l'

lemma isComposite_of_check_range {k start len : ℕ} (h_all : check_range start len = true) (hk1 : start ≤ k) (hk2 : k < start + len) : isComposite 1408 k = true := by
  induction len with
  | zero => omega
  | succ l ih =>
    unfold check_range at h_all
    rw [Bool.and_eq_true] at h_all
    have h_curr := h_all.1
    have h_prev := h_all.2
    rcases Nat.eq_or_lt_of_le (by omega : k ≤ start + l) with rfl | h_lt
    · exact h_curr
    · exact ih h_prev (by omega)

theorem check_b1 : check_range 1 100 = true := by decide
theorem check_b2 : check_range 101 100 = true := by decide
theorem check_b3 : check_range 201 100 = true := by decide
theorem check_b4 : check_range 301 100 = true := by decide
theorem check_b5 : check_range 401 100 = true := by decide
theorem check_b6 : check_range 501 100 = true := by decide
theorem check_b7 : check_range 601 100 = true := by decide
theorem check_b8 : check_range 701 100 = true := by decide
theorem check_b9 : check_range 801 100 = true := by decide
theorem check_b10 : check_range 901 100 = true := by decide
theorem check_b11 : check_range 1001 100 = true := by decide
theorem check_b12 : check_range 1101 100 = true := by decide
theorem check_b13 : check_range 1201 100 = true := by decide
theorem check_b14 : check_range 1301 100 = true := by decide
theorem check_b15 : check_range 1401 7 = true := by decide

lemma isComposite_all (k : ℕ) (hk0 : 0 < k) (hkn : k < 1408) : isComposite 1408 k = true := by
  have : k ≤ 1407 := by omega
  by_cases h15 : 1401 ≤ k
  · exact isComposite_of_check_range check_b15 (by omega) (by omega)
  by_cases h14 : 1301 ≤ k
  · exact isComposite_of_check_range check_b14 (by omega) (by omega)
  by_cases h13 : 1201 ≤ k
  · exact isComposite_of_check_range check_b13 (by omega) (by omega)
  by_cases h12 : 1101 ≤ k
  · exact isComposite_of_check_range check_b12 (by omega) (by omega)
  by_cases h11 : 1001 ≤ k
  · exact isComposite_of_check_range check_b11 (by omega) (by omega)
  by_cases h10 : 901 ≤ k
  · exact isComposite_of_check_range check_b10 (by omega) (by omega)
  by_cases h9 : 801 ≤ k
  · exact isComposite_of_check_range check_b9 (by omega) (by omega)
  by_cases h8 : 701 ≤ k
  · exact isComposite_of_check_range check_b8 (by omega) (by omega)
  by_cases h7 : 601 ≤ k
  · exact isComposite_of_check_range check_b7 (by omega) (by omega)
  by_cases h6 : 501 ≤ k
  · exact isComposite_of_check_range check_b6 (by omega) (by omega)
  by_cases h5 : 401 ≤ k
  · exact isComposite_of_check_range check_b5 (by omega) (by omega)
  by_cases h4 : 301 ≤ k
  · exact isComposite_of_check_range check_b4 (by omega) (by omega)
  by_cases h3 : 201 ≤ k
  · exact isComposite_of_check_range check_b3 (by omega) (by omega)
  by_cases h2 : 101 ≤ k
  · exact isComposite_of_check_range check_b2 (by omega) (by omega)
  · exact isComposite_of_check_range check_b1 (by omega) (by omega)

lemma get?_eq_some_getD {α : Type} [Inhabited α] (l : List α) (i : ℕ) (h_len : i < l.length) :
    l[i]? = some (l.getD i default) := by
  have h_opt : l[i]?.isSome := by
    rw [List.isSome_getElem?_iff]
    exact h_len
  obtain ⟨v, hv⟩ := Option.isSome_iff_exists.mp h_opt
  rw [hv]
  have h_getD : l.getD i default = v := by
    rw [List.getD_eq_getElem?_getD, hv, Option.getD_some]
  rw [h_getD]

def check_exponents (limit : ℕ) : Bool :=
  match limit with
  | 0 => true
  | l' + 1 => decide (get_exponent (l' + 1) == Nat.totient (1408 - (l' + 1)) / 2) && check_exponents l'

lemma exponents_eq_of_check_exponents {limit : ℕ} (h : check_exponents limit = true) (k : ℕ) (hk1 : 1 ≤ k) (hk2 : k ≤ limit) :
    get_exponent k = Nat.totient (1408 - k) / 2 := by
  induction limit with
  | zero => omega
  | succ l ih =>
    unfold check_exponents at h
    rw [Bool.and_eq_true] at h
    have h_curr := h.1
    have h_prev := h.2
    rcases Nat.eq_or_lt_of_le hk2 with rfl | h_lt
    · exact Nat.eq_of_beq_eq_true (of_decide_eq_true h_curr)
    · have : k ≤ l := by omega
      exact ih h_prev (by omega) this

theorem check_exponents_true : check_exponents 1407 = true := by decide

theorem oeis_234360_conjecture_0.disproof :
  ¬ ((∀ n, 1 < n → 0 < a n) ∧
     (∀ n, 5 < n → ∃ k, 0 < k ∧ k < n ∧ Nat.Prime ((k + 1) ^ (Nat.totient (n - k) / 2) - k))) := by
  intro h
  have h2 := h.2 1408 (by decide)
  rcases h2 with ⟨k, hk0, hkn, hkp⟩
  have h_comp := isComposite_all k hk0 hkn
  have h_not_prime := isComposite_correct 1408 k h_comp
  have h_le_1407 : k ≤ 1407 := by omega
  have h_hk1 : 1 ≤ k := hk0
  have h_tot_eq := exponents_eq_of_check_exponents check_exponents_true k h_hk1 h_le_1407
  rw [h_tot_eq] at h_not_prime
  exact h_not_prime hkp
